/**
 * Created by pekko1215 on 2017/07/15.
 */
var YakuData = [{
        name: "はずれ",
        pay: [0, 0, 0]
    },
    {
        name: "リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "6枚役",
        pay: [6, 6, 15]
    },
    {
        name: "スイカ",
        pay: [3, 0, 0]
    },
    {
        name: "チェリー",
        pay: [0, 0, 0]
    },
    {
        name: "代替リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: "代替リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: "代替リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: "1枚役",
        pay: [1, 0, 0]
    },
    {
        name: "1枚役",
        pay: [1, 0, 0]
    },
    {
        name: "リーチ目リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: "リーチ目リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: "リーチ目リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: "リーチ目リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: "リーチ目リプレイ",
        pay: [0, 0, 0]
    },
    {
        name: '赤7',
        pay: [0, 0, 0]
    },
    {
        name: '青7',
        pay: [0, 0, 0]
    },
    {
        name: 'BARリプレイ',
        pay: [0, 0, 0]
    },
    {
        name: 'BARリプレイ',
        pay: [0, 0, 0]
    },
    {
        name: 'JACIN',
        pay: [0, 0, 0]
    },
    {
        name: 'JACIN',
        pay: [0, 15, 0]
    }
]